প্লে লিস্টটি সবাই শেয়ার করুন। নিজের টাইম লাইনে রাখার মত প্লে লিস্ট। 
✔হায়ার স্টাডি খুঁটিনাটি প্যাকেজ:
**গুগল থেকে প্রফেসর খুঁজে বের করার উপায় হাতে কলমে: https://youtu.be/DLDQyneFZ5w 
**মাস্টার্স, পিএইচডির জন্য প্রফেসরদের ইমেলে কি লিখতে হয়: https://youtu.be/_yNnWm3XdyY 
** প্রফেসর রিপ্লাই না দিলে ফলো-আপ ইমেইল কিভাবে লিখবেন?: https://youtu.be/ZeU352-XwRA
** প্রফেসরদের সপ্তাহের কোন দিনে কখন ইমেইল দেবেন? : https://youtu.be/mMbv8g1yCO8 
**সেন্ট্রালি এপ্লিকেশন করে (প্রফেসরকে ইমেইল করা ছাড়া) কানাডায় ফান্ড: https://youtu.be/dS5vNvaTXSM
** রিসার্চ ফান্ডিং আছে এমন প্রফেসর খুঁজে বের করার পাঁচটি গোল্ডেন টিপস: https://youtu.be/5g807iZv7fc 
** কিভাবে ফান্ডিং সহ অস্ট্রেলিয়ান প্রফেসর খুজবেন: https://youtu.be/twVnSe2xz08 
** রিসার্চ ফান্ডিং আছে এমন ক্যানাডিয়ান প্রফেসর কিভাবে খুজবেন?:  https://youtu.be/YC0qi_eq-rI 
****আমেরিকায় কি মাস্টার্স ছাড়াই ডিরেক্ট পিএইচডিতে এপ্লাই করা যায়? বিস্তারিত: https://youtu.be/WBwrFGa_6OA 
**লো সিজিপি নিয়ে, ও রিসার্চ পেপার ছাড়া আমেরিকাতে স্কলারশিপ বিস্তারিত:
https://youtu.be/UDIoG0bBxUU
**পিএইচডি কোথায় করবেন  আমেরিকা কানাডা ইউকে নাকি অস্ট্রেলিয়ায়? বিস্তারিত: https://youtu.be/bpPeK-dNT6Y
**কাদের কানাডায় মাস্টার্স করতে আসা উচিত? কাদের উচিত নয়?
https://youtu.be/QX0I3fns7iA
**স্কলারশিপ প্রাপ্তিতে স্টাডি গ্যাপ, বয়স ও জব এক্সপেরিয়েন্স কোনো বড় বাঁধা কিনা?
https://youtu.be/ceadzFC5C_s
**কানাডাতে এপ্লাইয়ের সময় নিজ প্রোফাইল অনুযায়ী ভার্সিটি কিভাবে সিলেক্ট করবেন?
https://youtu.be/A4HfS4qPz8w
✔ স্কলারশিপ ও হায়ার স্টাডিজ প্যাকেজ:
** আয়ারল্যান্ড গভমেন্ট MS ও PhD স্কলারশিপ (সব সাবজেক্ট) বিস্তারিত: https://youtu.be/SAX7XE-Jw2g
**বেলজিয়াম গভমেন্ট স্কলারশিপ- মাস্টার্স সব সাবজেক্ট- বিস্তারিত: 
https://youtu.be/pScHdJfTdp0 
**সাউথ কোরিয়াতে স্কলারশিপ বিস্তারিত: https://youtu.be/TECKCiqUlrY 
**ইরেসমাস মুন্ডাস স্কলারশিপ বিস্তারিত: https://youtu.be/fGamzuHzOMY 
** কানাডায় আন্ডারগ্রাজুয়েট পড়াশুনা: https://youtu.be/JKytzcoXCGk 
**কানাডায় MS/PhD স্কলারশিপ বিস্তারিত: https://youtu.be/30EEn_J_Hrg 
**EduCanada Exchange স্কলারশিপ বিস্তারিত: https://youtu.be/N2UlaNOQhXo 
** কানাডায় PRএর এপ্লিকেশন, সুবিধাবলী ও PhD রিসার্চ: https://youtu.be/DZwBccNTzDM 
**UBC Night:এপ্লিকেশন, প্রফেসর ম্যানেজ, রিসার্চ বিস্তারিত: https://youtu.be/xA8aLaOGoso 
**আমেরিকায় স্কলারশিপ বিস্তারিত: https://youtu.be/nME263qngfo 
**নেদারল্যান্ডসে স্কলারশিপ বিস্তারিত: https://youtu.be/nnkleZSCsws 
**সুইডেনে স্কলারশিপ বিস্তারিত: https://youtu.be/a4TLDnl5n6E 
** অস্ট্রেলিয়ায় স্কলারশিপ, হায়ার স্টাডি ও রিসার্চ: https://youtu.be/v_MKkGl0AhY 
** স্কলারশিপ ও ফান্ডিং এর খুঁটিনাটি:  https://youtu.be/Ia4xuUH8ceg 
** UK কমনওয়েলথ স্কলারশিপ নিয়ে বিস্তারিত:https://is.gd/A8IPhY 
** জার্মানিতে হায়ার স্টাডিজ : A টু Z:https://youtu.be/aODRLYfhEbg 
** আমেরিকা ও কানাডাতে ফুল ফান্ডিং নিয়ে MBA বিস্তারিত: https://youtu.be/r9pDifz82_U 
**GRE ছাড়া আমেরিকাতে এনথ্রোপলজি ও আর্কিওলজিতে মাস্টার্স ফুল স্কলারশিপ বিস্তারিত:
https://youtu.be/f0wXO_KUaRI
✔রিসার্চ প্যাকেজ:
** রিসার্চ শুরু করার ৫টি সহজ ধাপ: সব সাবজেক্টের জন্য
https://youtu.be/j_cHkFCqEsA
**গুগল স্কলার থেকে কিভাবে রিসার্চ পেপার সার্চ ও ডাউনলোড করে পড়বে?: https://youtu.be/q4QxdlMJ2Bs 
**রিসার্চ কিভাবে শুরু করবে? পাবলিশ কিভাবে করবে?: https://youtu.be/GWIGi5QHUXA 
**IEEE পেপার নিয়ে ভুল ধারণা- লোকাল ও ইন্টারন্যাশনাল কনফারেন্স: https://youtu.be/k62HVJznXkg 
**দেশের বাইরে গবেষণা: ড. আতিয়ার রহমান- চেয়ারম্যান, বায়োকেমিস্ট্রি, চট্টগ্রাম বিশ্ববিদ্যালয়: https://youtu.be/4Z3SWNROdqg 
**ইকোনোমিক্স, বিজনেস স্টাডিজ ও সোশ্যাল সায়েন্সের রিসার্চ পেপার ও থিসিস লেখার ড্যাটা কোথায় পাওয়া যাবে?: https://youtu.be/votiIYYqgW0 
**বাংলাদেশের শিক্ষার্থীদের গবেষণায় শ্রেষ্ঠত্ব অর্জনের উপায়: ড. রউফুল আলম https://youtu.be/8UJ3VLx_VAA
**অস্ট্রেলিয়া, ডেনমার্ক, নর্থ আমেরিকায় স্কলারশিপ ও রিসার্চ গাইডলাইন:  https://youtu.be/y5c4tkmkkZI
✔ইমিগ্রেশন/বাইরে সেটেল হওয়া প্যাকেজ:
**আমেরিকা ও কানাডায় স্টাডি ভিসায় পার্ট-টাইম জব বৃত্তান্ত: https://youtu.be/C18LKhCkkCE 
**কানাডার নতুন চমকপ্রদ ইমিগ্রেশন পলিসি 2020: https://youtu.be/OTbPffqhYLc
**পড়াশুনা শেষ করে কানাডায় পিআর পাওয়া বা সেটেল হওয়াটা কতটা সহজ?: https://youtu.be/Qy7d6gUYNjA 
** আমেরিকা নাকি কানাডায় সেটেল হওয়া ইজি? কোথায় পড়বেন? : 
https://youtu.be/igIbNT6-9pw 
✔IELTS প্রিপারেশন প্যাকেজ:
**IELTS প্রিপারেশন নিজে নিজে শুরু করার দুর্দান্ত টিপস: https://youtu.be/YplPPazRLSE
**IELTS কমপ্লেক্স সেন্টেন্স রাইটিং একদম ভেঙ্গে ভেংগে লিখা শিখুন : https://youtu.be/2Cg_ofESdvo 
** IELTS কমপ্লেক্স সেন্টেন্স লিখার Baby steps: https://youtu.be/T02zW-JWfMA 
**IELTS writing Task1 গ্রাফের ড্যাটাগুলো একই বাক্যে সুনিপুনভাবে তুলে ধরার 7+ স্কোর টেকনিক: https://youtu.be/Hqfvk5XDlx8 
**ইংলিশ স্পিকিংয়ে মুখের জড়তা কাটিয়ে কিভাবে ফ্লুয়েন্সি বাড়াবেন?: https://youtu.be/F58U1LrMThw
**IELTS স্পিকিং মক টেস্ট: https://youtu.be/XgBd9PSlIGg 
**IELTS স্পিকিং এক্সামের মার্কিং ক্রাইটেরিয়া ও ভালো স্কোর পাবার উপায়: https://youtu.be/GJalAWRUr20 
**IELTS স্পিকিংয়ে "আ-উ" শব্দ এড়ানোর কৌশল কি?: https://youtu.be/9XSpXSK14G8 
✔ GRE প্রিপারেশন প্যাকেজ:
** GRE পরীক্ষার খুঁটিনাটি: সিলেবাস, ফরম্যাট, রেজিস্ট্রেশন, স্কোর পাঠানো বিস্তারিত  তথ্য:
https://youtu.be/e5K2aGV9jHU
✔ফোনেটিক্স প্যাকেজ (নেটিভদের মত ইংরেজি বলা শিখুন):
** ব্রিটিশ ও আমেরিকান ইংলিশ উচ্চারণ পার্থক্য- শুনে শুনে শিখুন: https://youtu.be/AA2PAdSMkF4 
**Phonetics: শুদ্ধ উচ্চারণে ইংরেজি শিখুন- Phlegmatic: https://youtu.be/0jpPvHc0iTs 
**Phonetics: শুদ্ধ উচ্চারণে ইংরেজি শিখুন-  Voracious: https://youtu.be/7pX98qwqri4 
**Phonetics: শুদ্ধ উচ্চারণে ইংরেজি শিখুন-  Erudite: https://youtu.be/zFHySn421WA 
**Phonetics: শুদ্ধ উচ্চারণে ইংরেজি শিখুন-  Pragmatic: https://youtu.be/MzEBy9vJY3s 
**Phonetics: শুদ্ধ উচ্চারণে ইংরেজি শিখুন-  Truculence: https://youtu.be/FJVmiuZKj4Y 
